# Урок 2. Задание 1.
# Выяснить тип результата выражений:
# 15 * 3
# 15 / 3
# 15 // 2
# 15 ** 2

#       Дата  Автор
# 2021.06.08  Кузнецов Денис

print('Вариант 1---------------------------')
print('Тип выражения 15 * 3', type(15 * 3))
print('Тип выражения 15 / 3', type(15 / 3))
print('Тип выражения 15 // 2', type(15 // 2))
print('Тип выражения 15 ** 2', type(15 ** 2))

print('Вариант 2---------------------------')
op_1 = 15 * 3
op_2 = 15 / 3
op_3 = 15 // 2
op_4 = 15 ** 2
print('Тип выражения 15 * 3', type(op_1))
print('Тип выражения 15 / 3', type(op_2))
print('Тип выражения 15 // 2', type(op_3))
print('Тип выражения 15 ** 2', type(op_4))
